Repository: Plov94/td-staff
Catalog: languages/td-staff-*.po
Languages: nb_no

source: Unknown
nb_no: Ukjent

source: Invalid date
nb_no: Ugyldig dato

source: TD Staff: Another plugin is trying to access td_tech() before plugins_loaded. This may cause issues.
nb_no: TD Staff: Et annet programtillegg prøver å bruke td_tech() før plugins_loaded. Dette kan skape problemer.

source: Failed to encrypt app password.
nb_no: Kunne ikke kryptere app-passord.

source: Staff ID is required.
nb_no: Ansatt-ID er påkrevd.

source: Exception type is required.
nb_no: Unntakstype er påkrevd.

source: Invalid exception type.
nb_no: Ugyldig unntakstype.

source: Start time is required.
nb_no: Starttid er påkrevd.

source: End time is required.
nb_no: Slutttid er påkrevd.

source: End time must be after start time.
nb_no: Slutttid må være etter starttid.

source: Invalid datetime format.
nb_no: Ugyldig dato-/tidsformat.

source: Sunday
nb_no: Søndag

source: Monday
nb_no: Mandag

source: Tuesday
nb_no: Tirsdag

source: Wednesday
nb_no: Onsdag

source: Thursday
nb_no: Torsdag

source: Friday
nb_no: Fredag

source: Saturday
nb_no: Lørdag

source: Invalid email address.
nb_no: Ugyldig e-postadresse.

source: Staff member not found.
nb_no: Ansatt ble ikke funnet.

source: Failed to update staff member.
nb_no: Kunne ikke oppdatere ansatt.

source: Display name is required.
nb_no: Visningsnavn er påkrevd.

source: Email is required.
nb_no: E-post er påkrevd.

source: Staff
nb_no: Ansatte

source: All Staff
nb_no: Alle ansatte

source: Add New
nb_no: Legg til ny

source: Edit Staff Member
nb_no: Rediger ansatt

source: Work Hours
nb_no: Arbeidstid

source: Exceptions
nb_no: Unntak

source: Settings
nb_no: Innstillinger

source: Staff member updated successfully.
nb_no: Ansatt ble oppdatert.

source: Staff member created successfully.
nb_no: Ansatt ble opprettet.

source: Failed to save staff member.
nb_no: Kunne ikke lagre ansatt.

source: Work hours updated successfully.
nb_no: Arbeidstid ble oppdatert.

source: Exception added successfully.
nb_no: Unntak ble lagt til.

source: Failed to add exception.
nb_no: Kunne ikke legge til unntak.

source: Settings saved successfully.
nb_no: Innstillinger ble lagret.

source: All Status
nb_no: Alle statuser

source: Active
nb_no: Aktiv

source: Inactive
nb_no: Inaktiv

source: All Skills
nb_no: Alle ferdigheter

source: Filter
nb_no: Filtrer

source: Search staff...
nb_no: Søk blant ansatte …

source: Search
nb_no: Søk

source: Bulk Actions
nb_no: Massehandlinger

source: Deactivate
nb_no: Deaktiver

source: Apply
nb_no: Bruk

source: Name
nb_no: Navn

source: Email
nb_no: E-post

source: Phone
nb_no: Telefon

source: Skills
nb_no: Ferdigheter

source: Actions
nb_no: Handlinger

source: No staff found.
nb_no: Fant ingen ansatte.

source: Edit
nb_no: Rediger

source: Hours
nb_no: Arbeidstid

source: Display Name
nb_no: Visningsnavn

source: WordPress User
nb_no: WordPress-bruker

source: — No WordPress User —
nb_no: Søk blant ansatte …

source: Configured
nb_no: Konfigurert

source: Missing
nb_no: Mangler

source: Missing (will fall back to KMS if present)
nb_no: Mangler (faller tilbake til KMS hvis tilgjengelig)

source: Missing (email lookup will use plaintext fallback)
nb_no: Mangler (e-postoppslag bruker klartekst som reserve)

source: Timezone
nb_no: Tidssone

source: Enter skills separated by commas (e.g., "Plumbing, Electrical, HVAC").
nb_no: Skriv inn ferdigheter separert med komma (f.eks. «Plumbing, Electrical, HVAC»).

source: Weight
nb_no: Vekting

source: Priority weight for assignment (1-100, higher = more preferred).
nb_no: Prioritetsvekting for tildeling (1–100, høyere = mer foretrukket).

source: Cooldown Period
nb_no: Nedkjølingsperiode

source: Minimum seconds between assignments (0 = no cooldown).
nb_no: Minste antall sekunder mellom tildelinger (0 = ingen nedkjøling).

source: Nextcloud/CalDAV Integration
nb_no: Nextcloud/CalDAV-integrasjon

source: Base URL
nb_no: Grunn-URL

source: Calendar Path
nb_no: Kalendersti

source: Username
nb_no: Brukernavn

source: App Password
nb_no: App-passord

source: Leave blank to keep existing password.
nb_no: La stå tomt for å beholde eksisterende passord.

source: Generate an app password in your Nextcloud settings.
nb_no: Generer et app-passord i Nextcloud-innstillingene dine.

source: Test Connection
nb_no: Test tilkobling

source: Update Staff Member
nb_no: Oppdater ansatt

source: Add Staff Member
nb_no: Legg til ansatt

source: Cancel
nb_no: Avbryt

source: Quick Actions
nb_no: Hurtighandlinger

source: Manage Work Hours
nb_no: Administrer arbeidstid

source: Manage Exceptions
nb_no: Administrer unntak

source: Back to Edit Staff Member
nb_no: Tilbake til rediger ansatt

source: Set the regular work hours for this staff member. Times are in the staff member's local timezone.
nb_no: Sett ordinær arbeidstid for denne ansatte. Tidene vises i den ansattes lokale tidssone.

source: Timezone:
nb_no: Tidssone:

source: Enabled
nb_no: Aktivert

source: Day
nb_no: Dag

source: Start Time
nb_no: Starttid

source: End Time
nb_no: Sluttid

source: Note: Currently only one time period per day is supported. Multiple shifts per day will be supported in a future version.
nb_no: Merk: For øyeblikket støttes bare én tidsperiode per dag. Flere skift per dag vil bli støttet i en senere versjon.

source: Save Work Hours
nb_no: Lagre arbeidstid

source: Related Actions
nb_no: Relaterte handlinger

source: Add New Exception
nb_no: Legg til nytt unntak

source: Select type...
nb_no: Velg type …

source: Holiday
nb_no: Helligdag

source: Sick Day
nb_no: Sykedag

source: Custom
nb_no: Tilpasset

source: Time in %s
nb_no: Tid i %s

source: End:
nb_no: Slutt:

source: Note:
nb_no: Notat:

source: Optional note...
nb_no: Valgfritt notat …

source: Add Exception
nb_no: Legg til unntak

source: Current Exceptions
nb_no: Gjeldende unntak

source: No exceptions found.
nb_no: Fant ingen unntak.

source: End
nb_no: Slutt

source: Duration
nb_no: Varighet

source: Note
nb_no: Notat

source: Delete
nb_no: Slett

source: TD Staff Settings
nb_no: TD Staff-innstillinger

source: Default Nextcloud Base URL
nb_no: Standard Nextcloud-grunn-URL

source: Default base URL that will be pre-filled when adding new staff members.
nb_no: Standard grunn-URL som forhåndsutfylles når nye ansatte legges til.

source: Data Management
nb_no: Datahåndtering

source: Allow hard uninstall to remove all data
nb_no: Tillat hard avinstallering å fjerne all data

source: When enabled, uninstalling the plugin will permanently delete all staff data, work schedules, and exceptions. When disabled, data is preserved even after uninstall.
nb_no: Når aktivert vil avinstallering slette all ansattdata, arbeidstider og unntak permanent. Når deaktivert, bevares data etter avinstallering.

source: Save Settings
nb_no: Lagre innstillinger

source: API Information
nb_no: API-informasjon

source: This plugin provides both PHP and REST APIs for other plugins to access staff data.
nb_no: Dette programtillegget tilbyr både PHP- og REST-API-er slik at andre tillegg kan få tilgang til ansattdata.

source: REST API Endpoints
nb_no: REST API-endepunkter

source: Method
nb_no: Metode

source: Endpoint
nb_no: Endepunkt

source: Description
nb_no: Beskrivelse

source: List all staff
nb_no: List alle ansatte

source: Get single staff member
nb_no: Hent én ansatt

source: Get staff work hours
nb_no: Hent arbeidstid for ansatt

source: Get staff exceptions
nb_no: Hent unntak for ansatt

source: Create new staff member (admin only)
nb_no: Opprett ny ansatt (kun admin)

source: Update staff member (admin only)
nb_no: Oppdater ansatt (kun admin)

source: PHP API Example
nb_no: PHP API-eksempel

source: System Information
nb_no: Systeminformasjon

source: Plugin Version
nb_no: Tilleggsversjon

source: API Version
nb_no: API-versjon

source: Database Version
nb_no: Databaseversjon

source: Encryption Available
nb_no: Kryptering tilgjengelig

source: Yes (AES-256-GCM)
nb_no: Ja (AES-256-GCM)

source: No (OpenSSL not available)
nb_no: Nei (OpenSSL er ikke tilgjengelig)

source: Total Staff
nb_no: Totalt antall ansatte

source: %d total (%d active)
nb_no: %d totalt (%d aktive)

source: WordPress Version
nb_no: WordPress-versjon

source: PHP Version
nb_no: PHP-versjon

source: Add New Staff
nb_no: Legg til ansatt

source: View Staff Member
nb_no: Vis ansatt

source: Export Staff Data
nb_no: Eksporter ansattdata

source: Export all staff data, work schedules, and exceptions. CalDAV credentials are excluded for security.
nb_no: Eksporter all ansattdata, arbeidstider og unntak. CalDAV-legitimasjon ekskluderes av sikkerhetsgrunner.

source: Include inactive staff
nb_no: Ta med inaktive ansatte

source: Import Staff Data
nb_no: Importer ansattdata

source: Import staff data from a previously exported JSON file.
nb_no: Importer ansattdata fra en tidligere eksportert JSON-fil.

source: Are you sure? This will modify your staff data.
nb_no: Er du sikker? Dette vil endre ansattdataene dine.

source: Imported staff will need CalDAV credentials configured manually.
nb_no: Importerte ansatte må få CalDAV-legitimasjon konfigurert manuelt.

source: ✅ Week Copied
nb_no: ✅ Uken er kopiert

source: 📋 Copy Week
nb_no: 📋 Kopier uke

source: This will replace all current work hours. Continue?
nb_no: Dette vil erstatte all nåværende arbeidstid. Fortsette?

source: This will clear all work hours. Continue?
nb_no: Dette vil slette all arbeidstid. Fortsette?

source: This will replace current work hours with the selected template. Continue?
nb_no: Dette vil erstatte nåværende arbeidstid med valgt mal. Fortsette?

source: Testing...
nb_no: Tester …

source: Please fill in all CalDAV fields before testing.
nb_no: Fyll ut alle CalDAV-felter før testing.

source: Connection test failed.
nb_no: Tilkoblingstest mislyktes.

source: Are you sure you want to delete this exception?
nb_no: Er du sikker på at du vil slette dette unntaket?

source: Failed to delete exception.
nb_no: Kunne ikke slette unntak.

source: Please enter a valid email address.
nb_no: Skriv inn en gyldig e-postadresse.

source: Please enter a valid phone number.
nb_no: Skriv inn et gyldig telefonnummer.

source: URL must use HTTP or HTTPS protocol.
nb_no: URL må bruke HTTP- eller HTTPS-protokoll.

source: Please enter a valid URL.
nb_no: Skriv inn en gyldig URL.

source: All CalDAV fields are required when any CalDAV field is provided.
nb_no: Alle CalDAV-felter er påkrevd når ett av dem er oppgitt.

source: Weight must be between 1 and 100.
nb_no: Vekting må være mellom 1 og 100.

source: Cooldown must be non-negative.
nb_no: Nedkjøling kan ikke være negativ.

source: Remove
nb_no: Fjern

source: to
nb_no: til

source: + Add Shift
nb_no: + Legg til skift

source: Compatibility Notice - TD Staff
nb_no: Kompatibilitetsvarsel – TD Staff

source: Your WordPress version is outdated for PHP 8.1+
nb_no: Din WordPress-versjon er utdatert for PHP 8.1+

source: You're running WordPress %s with PHP %s. For optimal compatibility and to eliminate PHP deprecation warnings, please update WordPress to version 6.0 or higher.
nb_no: Du kjører WordPress %s med PHP %s. For best kompatibilitet og for å unngå PHP-depresieringsvarsler, oppdater WordPress til versjon 6.0 eller nyere.

source: The TD Staff plugin will continue to function, but you may see PHP 8.1 deprecation warnings in your error logs until WordPress is updated.
nb_no: Tillegget TD Staff vil fortsatt fungere, men du kan se PHP 8.1-depresieringsvarsler i feilloggene dine til WordPress er oppdatert.

source: Update WordPress
nb_no: Oppdater WordPress

source: Learn More
nb_no: Les mer

source: Cache purged and assets busted.
nb_no: Cache tømt og ressurser oppdatert.

source: Insufficient permissions.
nb_no: Utilstrekkelige tillatelser.

source: Export failed: %s
nb_no: Eksport mislyktes: %s

source: Please select a valid file to import.
nb_no: Velg en gyldig fil å importere.

source: Invalid JSON file.
nb_no: Ugyldig JSON-fil.

source: Invalid file format. Missing staff data.
nb_no: Ugyldig filformat. Mangler ansattdata.

source: Successfully imported %d staff members.
nb_no: Vellykket import av %d ansatte.

source: Import failed: %s
nb_no: Import mislyktes: %s

source: Exception not found.
nb_no: Unntak ble ikke funnet.

source: Exception deleted successfully.
nb_no: Unntak ble slettet.

source: Invalid staff ID.
nb_no: Ugyldig ansatt-ID.

source: Deactivated %d staff member.
nb_no: Deaktiverte %d ansatt.

source: Include all weekdays with empty arrays
nb_no: Inkluder alle ukedager med tomme lister

source: Weekly hours array
nb_no: Ukentlig arbeidstidsliste

source: Start date (UTC)
nb_no: Startdato (UTC)

source: End date (UTC)
nb_no: Sluttdato (UTC)

source: Exception type
nb_no: Unntakstype

source: Start time (UTC)
nb_no: Starttid (UTC)

source: End time (UTC)
nb_no: Slutttid (UTC)

source: Optional note
nb_no: Valgfritt notat

source: Exception ID
nb_no: Unntaks-ID

source: No CalDAV credentials configured for this staff member.
nb_no: Ingen CalDAV-legitimasjon er konfigurert for denne ansatte.

source: Connection successful! CalDAV server detected.
nb_no: Tilkobling vellykket! CalDAV-server oppdaget.

source: Authentication failed. Please check your username and app password.
nb_no: Autentisering mislyktes. Kontroller brukernavn og app-passord.

source: Calendar not found. Please check the calendar path.
nb_no: Kalender ikke funnet. Kontroller kalenderstien.

source: Unexpected response: HTTP %d
nb_no: Uventet svar: HTTP %d

source: PROPFIND test failed: %s
nb_no: PROPFIND-test mislyktes: %s

source: Connection successful! Calendar responded to PROPFIND request.
nb_no: Tilkobling vellykket! Kalender svarte på PROPFIND-forespørsel.

source: PROPFIND test returned HTTP %d. Server may not support CalDAV.
nb_no: PROPFIND-test returnerte HTTP %d. Serveren støtter kanskje ikke CalDAV.

source: Connection failed: %s
nb_no: Tilkobling mislyktes: %s

source: Invalid URL format.
nb_no: Ugyldig URL-format.

source: URL must include a valid hostname.
nb_no: URL må inneholde et gyldig vertsnavn.

source: CalDAV base URL is required when CalDAV is configured.
nb_no: CalDAV-grunn-URL er påkrevd når CalDAV er konfigurert.

source: Calendar path is required when CalDAV is configured.
nb_no: Kalendersti er påkrevd når CalDAV er konfigurert.

source: Username is required when CalDAV is configured.
nb_no: Brukernavn er påkrevd når CalDAV er konfigurert.

source: App password is required when CalDAV is configured.
nb_no: App-passord er påkrevd når CalDAV er konfigurert.

source: Invalid phone number format.
nb_no: Ugyldig telefonnummerformat.

source: Email address is required.
nb_no: E-postadresse er påkrevd.

source: View Staff Member: %s
nb_no: Vis ansatt: %s

source: u2190 Back to List
nb_no: u2190 Tilbake til listen

source: Basic Information
nb_no: Grunnleggende informasjon

source: Display Name:
nb_no: Visningsnavn:

source: Email:
nb_no: E-post:

source: Phone:
nb_no: Telefon:

source: CalDAV Configuration
nb_no: CalDAV-konfigurasjon

source: CalDAV Username:
nb_no: CalDAV-brukernavn:

source: Calendar Path:
nb_no: Kalendersti:

source: No skills assigned
nb_no: Ingen ferdigheter tilordnet

source: No work hours configured
nb_no: Ingen arbeidstid konfigurert

source: Exceptions & Time Off
nb_no: Unntak og fri

source: Date/Time
nb_no: Dato/tid

source: Unavailable
nb_no: Utilgjengelig

source: Sick Leave
nb_no: Sykefravær

source: Vacation
nb_no: Ferie

source: No upcoming exceptions or time-off scheduled
nb_no: Ingen kommende unntak eller fri planlagt

source: %d day
nb_no: %d dag

source: %d hour
nb_no: %d time

source: %d minute
nb_no: %d minutt

source: Staff Management
nb_no: Ansattadministrasjon

source: ud83dudcc1 Paste Week
nb_no: ud83dudcc1 Lim inn uke

source: ud83duddd1ufe0f Clear All
nb_no: ud83duddd1ufe0f Tøm alt

source: Quick Templates:
nb_no: Hurtigmaler:

source: Select template...
nb_no: Velg mal …

source: Weekdays 9-5
nb_no: Hverdager 9–17

source: Weekdays 8-6
nb_no: Hverdager 8–18

source: Full Week 9-5
nb_no: Hele uken 9–17

source: Split Shift (9-12, 1-5)
nb_no: Delt skift (9–12, 13–17)

source: Apply Template
nb_no: Bruk mal

source: Add multiple shifts per day by clicking "Add Shift". Each shift represents a continuous work period.
nb_no: Legg til flere skift per dag ved å klikke «Legg til skift». Hvert skift er en sammenhengende arbeidsperiode.

source: Export/Import Data
nb_no: Eksporter/importer data

source: JSON Format (recommended)
nb_no: JSON-format (anbefalt)

source: CSV Format (basic data only)
nb_no: CSV-format (kun grunnleggende data)

source: Include work hours
nb_no: Ta med arbeidstid

source: Include exceptions
nb_no: Ta med unntak

source: Download Export
nb_no: Last ned eksport

source: Select JSON file:
nb_no: Velg JSON-fil:

source: Merge with existing data
nb_no: Slå sammen med eksisterende data

source: Replace all existing data (destructive!)
nb_no: Erstatt all eksisterende data (destruktivt!)

source: Import Data
nb_no: Importer data

source: Important Notes:
nb_no: Viktige merknader:

source: CalDAV credentials (app passwords) are never exported for security reasons.
nb_no: CalDAV-legitimasjon (app-passord) eksporteres aldri av sikkerhetsgrunner.

source: Always backup your database before importing data.
nb_no: Ta alltid sikkerhetskopi av databasen før du importerer data.

source: CSV exports contain basic information only (no hours or exceptions).
nb_no: CSV-eksporter inneholder kun grunnleggende informasjon (ingen arbeidstid eller unntak).

source: Security & Encryption
nb_no: Sikkerhet og kryptering

source: Sensitive fields are encrypted at rest. For best security and search-by-email support, configure the following keys in wp-config.php or the environment:
nb_no: Sensitive felt er kryptert i hvile. For best sikkerhet og støtte for søk på e-post, konfigurer følgende nøkler i wp-config.php eller miljøet:

source: Sodium key for app passwords (XChaCha20-Poly1305).
nb_no: Sodium-nøkkel for app-passord (XChaCha20-Poly1305).

source: Sodium key for PII envelopes (emails/phones). Alias of KMS is also supported.
nb_no: Sodium-nøkkel for PII-konvolutter (e-poster/telefoner). Alias til KMS støttes også.

source: HMAC key for email blind index lookups.
nb_no: HMAC-nøkkel for blinde e-postindekssøk.

source: Keys should be 32 random bytes, base64-encoded. You can prefix values with base64: for clarity.
nb_no: Nøkler bør være 32 tilfeldige byte, base64-kodet. Du kan prefikse verdier med base64: for klarhet.

source: Migrate legacy CalDAV passwords u2192 sodium
nb_no: Migrer eldre CalDAV-passord u2192 sodium

source: Backfill PII envelopes/indexes
nb_no: Fyll opp PII-konvolutter/indekser

source: These operations are safe to run multiple times; they only update rows that need migration/backfill.
nb_no: Disse operasjonene kan trygt kjøres flere ganger; de oppdaterer bare rader som trenger migrering/utfylling.

source: Cache Management
nb_no: Håndtering av hurtigbuffer

source: If you notice old assets (CSS/JS) or stale admin behavior, you can purge caches and bump the asset version used by this plugin to force browsers and caching layers to fetch fresh files.
nb_no: Hvis du ser gamle ressurser (CSS/JS) eller utdatert oppførsel i admin, kan du tømme mellomlager og øke ressursversjonen som brukes av dette tillegget for å tvinge nettlesere og mellomlager til å hente ferske filer.

source: Purge Cache & Refresh Assets
nb_no: Tøm cache og oppdater ressurser

source: Purge all caches and force-refresh assets now?
nb_no: Tøm all cache og tvangsoppdater ressurser nå?

source: This attempts to flush WordPress object cache and common caching plugins (if present), and increments an internal asset version to defeat cache/minifiers.
nb_no: Dette forsøker å tømme WordPress-objektbuffer og vanlige cache-tillegg (om til stede), og øker en intern ressursversjon for å omgå cache/minifier.
